export type TExperience = {
  id: number;
  name: string;
  description: string[];
};

export const EXPERIENCE: TExperience[] = [
  {
    id: 1,
    name: '(주) 코코아',
    description: [
      '교수님의 추천으로 교수님께서 계신 곳에서 인턴 생활 경험',
      '공공기관 프로젝트에 대한 대형 SI 업무 프로세스 경험',
      '웹 개발자로서 첫걸음을 시작할 수 있었던 회사',
      '인천 & 충남소방서 소방 장비 관리프로그램 유지보수 및 커스터마이징 작업',
      '한국산업기술평가관리원(KEIT) 사내 경영정보시스템(MIS) 재구축 및 모바일 개발 참여',
    ],
  },
  {
    id: 2,
    name: '하경소프트',
    description: [
      '구매대행 & 배송 대행 관련 e-커머스 서비스 경험',
      '소기업에서의 업무 프로세스 경험',
      '수십 개의 고객(구매대행 쇼핑몰 사장님)과 직접 1:1 커뮤니케이션을 통한 커스터마이징작업 경험',
      '회사 특성상 개발뿐만 아니라 기획 & 퍼블리싱 & 고객 응대 등 다양한 포지션들의 경험',
      '빠른 이슈 처리와 요구사항을 정확하게 개발하여 높은 고객의 만족도 존재',
      '다양한 기술 스택 환경에서의 개발 경험',
      '높은 평가 결과',
    ],
  },
  {
    id: 3,
    name: '코리아센터',
    description: [
      '배송 대행 서비스에서 인지도 높은 몰테일팀에서의 글로벌 e-커머스 서비스 경험',
      '중견기업에서의 업무 프로세스 경험',
      '약 50만 명 이상의 회원 수를 보유한 곳에서의 개발 경험',
      '빠른 작업속도로 인하여 앱 내 메인 요소 작업들을 주로 담당(몰테일 앱 메인, 다해줌, okvit...)',
      '몰테일 앱 리뉴얼 작업 참여',
      '타 부서 간의 원활한 소통 능력',
      '높은 팀 내 평가 결과',
    ],
  },
  {
    id: 4,
    name: '리버스랩',
    description: [
      '학원 차량 공유 관련 모빌리티 서비스 경험',
      '스타트업에서의 업무 프로세스 경험',
      '프론트엔드 개발자로 직무전향 후 프론트엔드 개발자로서 첫 경험을 할 수 있었던 회사',
      '사수 및 프론트엔드 개발팀의 부재로 A-Z까지 혼자 업무수행을 하며 얻게 된 다양한 경험',
      '반응형 프로젝트 경험',
      '업무협업에 있어 원활한 소통 능력으로 함께 일하기 편한 직원',
      '높은 평가 결과',
    ],
  },
  {
    id: 5,
    name: '놀이의 발견',
    description: [
      '키즈 앱 플랫폼 서비스 경험',
      '스타트업이긴 하나 모기업(웅진씽크빅)이 존재하는 회사의 업무 프로세스 경험',
      '총 5명의 프론트엔드 개발자가 있는 프론트엔드 팀에서의 개발 경험',
      '레거시 프로젝트부터 신기술 스택의 프로젝트에서의 개발 경험',
      '반응형 프로젝트 경험',
      '랜딩 페이지 작업을 통해 SEO 맛보기 경험',
      '팀내 코드리뷰문화 및 매우 세세한 스타일가이드 준수를 통한 클린 코딩 경험',
      '타 부서 간의 원활한 소통 능력',
    ],
  },
  {
    id: 6,
    name: '씨제이대한통운',
    description: [
      '운송 플랫폼 서비스 경험',
      '대기업의 업무 프로세스 경험',
      '총 6명의 프론트엔드 개발자가 있는 프론트엔드 팀에서의 개발 경험',
      '서비스런칭 부터 그랜드오픈까지의 전 과정 참여 경험',
      '적극적인 팀내 코드리뷰문화 추진',
      '타 부서 간의 원활한 소통 능력',
      'ASAP 일정속에서의 일정 준수 능력',
    ],
  },
];
