export type TExperience = {
  id: number;
  name: string;
  description: string[];
};

export const EXPERIENCE: TExperience[] = [
  {
    id: 1,
    name: '(주) 코코아',
    description: [
      '교수님의 추천으로 교수님께서 계신 곳에서 인턴생활 경험',
      '공공기관 프로젝트에대한 대형 SI 업무프로세스 경험',
      '웹개발자로써 첫 걸음을 시작할 수 있었던 회사',
      '인천 & 충남소방서 소방장비관리프로그램 유지보수 및 커스터마이징 작업',
      '한국산업기술평가관리원(KEIT) 사내경영정보시스템(MIS) 재구축 및 모바일 개발참여',
    ],
  },
  {
    id: 2,
    name: '하경소프트',
    description: [
      '구매대행 & 배송대행관련 e-커머스 서비스 경험',
      '소기업에서의 업무프로세스 경험',
      '수십여개의 고객들(구매대행 쇼핑몰사장님)과 직접 1:1 커뮤니케이션을 통한 커스터마이징작업 경험',
      '회사특성상 개발뿐만아니라 기획 & 퍼블리싱 & 고객응대등 다양한 포지션들의 경험',
      '빠른 이슈처리와 요구사항을 정확하게 개발하여 높은 고객의 만족도 존재',
      '다양한 기술스택환경에서의 개발 경험',
      '높은 평가 결과',
    ],
  },
  {
    id: 3,
    name: '코리아센터',
    description: [
      '배송대행서비스에서 인지도 높은 몰테일팀에서의 글로벌 e-커머스 서비스 경험',
      '중견기업에서의 업무프로세스 경험',
      '약 50만명이상의 회원수를 보유한 곳에서의 개발 경험',
      '빠른 작업속도로인하여 앱내 메인요소작업들을 주로 담당(몰테일 앱 메인, 다해줌, okvit...)',
      '몰테일앱 리뉴얼 작업 참여',
      '타부서간의 원활한 소통능력',
      '높은 팀내 평가결과',
    ],
  },
  {
    id: 4,
    name: '리버스랩',
    description: [
      '학원차량 공유관련 모빌리티서비스 경험',
      '스타트업에서의 업무프로세스 경험',
      '프론트엔드개발자로 직무전향후 프론트엔드개발자로써 첫 경험을 할 수 있었던 회사',
      '사수 및 프론트엔드개발팀의 부재로 A-Z까지 혼자 업무수행을 하며 얻게된 다양한 경험',
      '반응형 프로젝트 경험',
      '업무협업에 있어 원활한 소통능력으로 함께 일하기 편한 직원',
      '높은 평가결과',
    ],
  },
  {
    id: 5,
    name: '놀이의 발견',
    description: [
      '키즈 앱 플랫폼 서비스 경험',
      '스타트업이긴하나 모기업(웅진씽크빅)이 존재하는 회사의 업무프로세스 경험',
      '총 5명의 프론트엔드개발자가 있는 프론트엔드팀에서의 개발 경험',
      '레거시프로젝트부터 신기술스택의 프로젝트에서의 개발 경험',
      '반응형 프로젝트 경험',
      '랜딩페이지 작업을 통해 SEO 맛보기 경험',
      '팀내 코드리뷰문화 및 매우 세세한 스타일가이드준수를 통한 클린코딩 경험',
      '타부서간의 원활한 소통능력',
    ],
  },
];
